Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Most of Quarkus tags have been registered in link:https://nvd.nist.gov[National Vulnerability Database] (NVD) using a Common Platform Enumeration (CPE) name format. All registered Quarkus CPE names can be found using link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&keyword=quarkus[this search query]. If a Quarkus tag represented by the given CPE name entry is affected by some CVE then you'll be able to follow a provided link to that CVE.
ja_jp: ほとんどのQuarkusタグは、Common Platform Enumeration (CPE)名の形式で link:https://nvd.nist.gov[National Vulnerability Database](NVD)に登録されています。登録されているすべてのQuarkusのCPE名は、 link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&amp;keyword=quarkus[この検索クエリ]を使用して見つけることができます。指定されたCPE名のエントリで表されるQuarkusタグが何らかのCVEの影響を受けている場合、そのCVEへのリンクを辿ることができます。

source: Most of our updates go out on <a href="https://twitter.com/quarkusio">Twitter</a>. Sometimes our project team speaks at industry events, and sometimes they post cool ways people use Quarkus. Wash, rinse, and retweet.
ja_jp: 我々のアップデートの多くは <a href="https://twitter.com/quarkusio">Twitter</a> で公開されています。 プロジェクトチームが業界のイベントで公園することもあれば、Quarkusのクールなユースケースを投稿することもあります。どんどんリツイートしてください。

source: Most of the JavaScript code in Dev UI is written using Lit, so look for the available operations in the Lit documentation. For instance, for each cycle can be done like this:
ja_jp: Dev UI の JavaScript コードのほとんどは Lit を使用して記述されているため、Lit ドキュメントで利用可能な操作を探してください。たとえば、各サイクルは次のようになります。

source: Most of the Quarkus tags are registered in the US National Vulnerability Database (NVD) in Common Platform Enumeration (CPE) name format.
ja_jp: Quarkusのタグの多くは、米国のNational Vulnerability Database（NVD）にCPE（Common Platform Enumeration）の名称形式で登録されています。

source: Most of the Quarkus tags are registered in the US link:https://nvd.nist.gov[National Vulnerability Database (NVD)] in Common Platform Enumeration (CPE) name format.
ja_jp: Quarkusのタグの多くは、米国の link:https://nvd.nist.gov[National Vulnerability Database（NVD）] にCPE（Common Platform Enumeration）の名前形式で登録されています。

source: Most of the Quarkus tags are registered in the US link:https://nvd.nist.gov[National Vulnerability Database] (NVD) in Common Platform Enumeration (CPE) name format. To view the registered Quarkus CPE names, use link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&keyword=quarkus[this search query].
ja_jp: Quarkusのタグのほとんどは、米国の link:https://nvd.nist.gov[National Vulnerability Database] （NVD）にCommon Platform Enumeration（CPE）名フォーマットで登録されています。登録されたQuarkusのCPE名を表示するには、 link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&keyword=quarkus[この検索クエリ] を使用します。

source: Most of the examples of the supported mechanisms sends authentication headers, please refer to the xref:grpc-service-consumption.adoc[gRPC Headers] section of the Consuming a gRPC Service guide for more information about the gRPC headers.
ja_jp: サポート対象メカニズムの例のほとんどは、認証ヘッダーを送信します。gRPC ヘッダーの詳細については、gRPC Service の使用ガイドの xref:grpc-service-consumption.adoc[gRPC ヘッダー] セクションを参照してください。

source: Most of the existing CDI code should work just fine but there are some small differences which follow from the Quarkus architecture and goals.
ja_jp: 既存の CDI コードのほとんどは問題なく動作するはずですが、Quarkus のアーキテクチャや目標との間には、わずかな相違点がいくつかあります。

source: Most of the fields in the previous diagram contain input data, except for the orange fields: A lesson's `timeslot` and `room` fields are unassigned (`null`) in the input data and assigned (not `null`) in the output data. OptaPlanner changes these fields during solving. Such fields are called planning variables. In order for OptaPlanner to recognize them, both the `timeslot` and `room` fields require an `@PlanningVariable` annotation. Their containing class, `Lesson`, requires an `@PlanningEntity` annotation.
ja_jp: 前の図のほとんどのフィールドには、オレンジ色のフィールドを除いて、入力データが含まれています。レッスンの `timeslot` フィールドと `room` フィールドは、入力データでは割り当てられておらず (`null`)、出力データでは割り当てられています (非 `null`)。OptaPlanner は、解決中にこれらのフィールドを変更します。このようなフィールドは、プランニング変数と呼ばれます。OptaPlanner がそれらを認識するためには、 `timeslot` フィールドと `room` フィールドの両方に `@PlanningVariable` アノテーションが必要です。それらを含むクラス `Lesson` には、 `@PlanningEntity` アノテーションが必要です。

source: Most of the time you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for AMQPは、 _dev_ モードで動作する複数のQuarkusアプリケーションが1つのブローカーを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most of the time you need to share the broker between applications. Dev Services for Kafka implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for Kafkaは、 _開発_ モードで動作する複数のQuarkusアプリケーションが1つのブローカーを共有するための _サービス発見_ メカニズムを実装しています。

source: Most of the time you need to share the broker between applications. Dev Services for Pulsar implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for Plusar は、 _開発_ モードで動作する複数の Quarkus アプリケーションが 1 つのブローカーを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most of the time you need to share the broker between applications. Dev Services for RabbitMQ implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for RabbitMQは、 _開発_ モードで動作する複数のQuarkusアプリケーションが1つのブローカーを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most of the time you need to share the cluster between applications. Dev Services for Kubernetes implements a _service discovery_ mechanism for your multiple Quarkus applications running in dev mode to share a single cluster.
ja_jp: ほとんどの場合、アプリケーション間でクラスターを共有する必要があります。Dev Services for Kubernetesは、開発モードで実行されている複数のQuarkusアプリケーションが1つのクラスターを共有するための _サービス検出_ メカニズムを実装しています。

source: Most of the time you need to share the registry between applications. Dev Services for Apicurio Registry implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single registry.
ja_jp: ほとんどの場合、アプリケーション間でレジストリを共有する必要があります。Dev Services for Apicurio Registryは、 _開発_ モードで動作する複数のQuarkusアプリケーションが1つのレジストリを共有するための _サービスディスカバリ_ メカニズムを実装しています。

source: Most of the time you need to share the server between applications. Dev Services for Infinispan implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
ja_jp: ほとんどの場合、アプリケーション間でサーバーを共有する必要があります。Dev Services for Infinispanは、 _dev_ モードで動作する複数のQuarkusアプリケーションが1つのサーバーを共有できるように、 _サービス検出_ メカニズムを実装しています。

source: Most of the time you need to share the server between applications. Dev Services for MongoDB implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
ja_jp: ほとんどの場合、アプリケーション間でサーバーを共有する必要があります。 Dev Services for MongoDBは、 _dev_ モードで実行されている複数のQuarkusアプリケーションが1つのサーバーを共有できるように、 _サービス検出_ メカニズムを実装しています。

source: Most of the time you need to share the server between applications. Dev Services for Redis implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
ja_jp: ほとんどの場合、アプリケーション間でサーバーを共有する必要があります。Dev Services for Redisは、 _開発_ モードで動作する複数のQuarkusアプリケーションが1つのサーバーを共有するための _サービスディスカバリ_ メカニズムを実装しています。

source: Most of the time you want to share the broker between applications. Dev Services for RabbitMQ implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for RabbitMQ は、_開発_ モードで動作する複数のQuarkusアプリケーションが 1 つのブローカーを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most of the time, the configuration above won't be necessary as either a JDBC driver or a reactive datasource extension will be present and not both.
ja_jp: 多くの場合、存在するのはJDBC ドライバーまたはリアクティブデータソース拡張のどちらかで、両方存在するわけではありません。そのため、上記の設定は必要ありません。

source: Most of the time, there are ways to achieve the same blocking operations in an asynchronous/reactive way, using https://smallrye.io/smallrye-mutiny/[Mutiny], http://hibernate.org/reactive/[Hibernate Reactive] or any of the xref:quarkus-reactive-architecture.adoc#quarkus-extensions-enabling-reactive[Quarkus Reactive extensions] for example:
ja_jp: ほとんどの場合、 https://smallrye.io/smallrye-mutiny/[Mutiny] 、 http://hibernate.org/reactive/[Hibernate Reactive] 、または xref:quarkus-reactive-architecture.adoc#quarkus-extensions-enabling-reactive[Quarkusリアクティブエクステンション] などを使って、同じブロック操作を非同期/リアクティブに実現する方法があります。

source: Most of the time, there are ways to achieve the same blocking operations in an asynchronous/reactive way, using https://smallrye.io/smallrye-mutiny/[Mutiny], https://hibernate.org/reactive/[Hibernate Reactive] or any of the xref:quarkus-reactive-architecture.adoc#quarkus-extensions-enabling-reactive[Quarkus Reactive extensions] for example:
ja_jp: ほとんどの場合、 https://smallrye.io/smallrye-mutiny/[Mutiny] 、 https://hibernate.org/reactive/[Hibernate Reactive] 、または xref:quarkus-reactive-architecture.adoc#quarkus-extensions-enabling-reactive[Quarkusリアクティブエクステンション] などを使って、同じブロック操作を非同期/リアクティブに実現する方法があります。

source: Most of the time, these beans should be declared as `@ApplicationScoped`.
ja_jp: ほとんどの場合、これらのBeanは `@ApplicationScoped` として宣言されるべきです。

source: Most of the time, you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: ほとんどの場合、アプリケーション間でブローカーを共有する必要があります。Dev Services for AMQP は、 _開発モード_ で動作する複数の Quarkus アプリケーションが1つのブローカーを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most of the time, you need to share the registry between applications. Dev Services for Apicurio Registry implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single registry.
ja_jp: ほとんどの場合、アプリケーション間でレジストリを共有する必要があります。Dev Services for Apicurio Registry は、_サービスディスカバリ_ メカニズムを実装しており、_開発モード_ で実行されている複数の Quarkus アプリケーションが単一のレジストリを共有できるようにします。

source: Most of these bindings propose two approaches:
ja_jp: これらのバインディングのほとんどは、2つのアプローチを提案しています:

source: Most of these properties are optional, but the sender address is required. It can either be set on an individual `Mail` instances using
ja_jp: これらのプロパティーのほとんどはオプションですが、送信者アドレスは必須です。これは、以下を使用して個々 の `Mail` インスタンスに設定できます。

source: Most useful operations
ja_jp: 最も便利な操作

source: Most well-known social OAuth2 providers enforce rate limiting, so you might prefer to cache UserInfo.
ja_jp: よく知られているソーシャル OAuth2 プロバイダーのほとんどはレート制限を実施しているため、UserInfo をキャッシュする方がよい場合があります。

source: Most well-known social OAuth2 providers enforce rate-limiting so there is a high chance you will prefer to have UserInfo cached.
ja_jp: よく知られているソーシャル OAuth2 プロバイダーのほとんどは帯域制限を実施しているため、UserInfo をキャッシュするのがよい場合が多いでしょう。

source: Mount the ConfigMap by adding a volume and mounting it in your _Deployment_ configuration:
ja_jp: ボリュームを追加して _Deployment_ 設定にマウントすることで、ConfigMap をマウントします。

source: Mount the ConfigMap in the container. Ensure that the path matches the one used in the configuration (in this example `/deployments/tls`).
ja_jp: ConfigMap をコンテナーにマウントします。 パスが設定で使用されているパスと一致していることを確認します (この例では `/deployments/tls`)。

source: Mount the ConfigMap volume in the container. Ensure that the mount path matches the path referenced in the configuration. In this example, `/deployments/tls`.
ja_jp: ConfigMap ボリュームをコンテナーにマウントします。マウントパスが設定で参照されているパスと一致していることを確認します。この例では `/deployments/tls` です。

source: Mount the host's directory `target/native-image` to the container's `/work`. Thus, the generated binary will also be written to this directory.
ja_jp: ホストのディレクトリ `target/native-image` をコンテナーの `/work` にマウントします。したがって、生成されたバイナリーもこのディレクトリに書き込まれます。

source: Mount the secret as a volume in the pod, which is the easiest way to use these certificates:
ja_jp: シークレットを Pod 内のボリュームとしてマウントします。これは、証明書を使用する最も簡単な方法です。

source: Mount the secret as a volume in your pod by updating your _Deployment_ configuration:
ja_jp: _Deployment_ 設定を更新して、シークレットを Pod 内のボリュームとしてマウントします。

source: Mount the secret in the container. Ensure that the path matches the one used in the configuration (here `/etc/tls`).
ja_jp: コンテナーにシークレットをマウントします。 パスが、設定で使用されているパス (ここでは `/etc/tls`) と一致していることを確認します。

source: Mounting volumes
ja_jp: Volumeのマウント

source: Mounts and Volumes
ja_jp: マウントとボリューム

source: Move Assertj outside of our BOM
ja_jp: AssertjをBOMの外に移動

source: Move individual non-application endpoints (/metrics and /liveness)
ja_jp: アプリケーション以外のエンドポイントを個別に移動 (/metrics と /liveness)

source: Move the `@RolesAllowed` annotation to the endpoint. This could be one of the safest ways because accessing `SecurityIdentity` from endpoint methods is never the blocking operation.
ja_jp: `@RolesAllowed` アノテーションをエンドポイントに移動します。 エンドポイントメソッドからの `SecurityIdentity` へのアクセスは決してブロッキング操作ではないので、これは最も安全な方法のひとつです。

source: Move the `src/main/java` from your generated project to `runtime/src/main/codestarts/quarkus/aloha-codestart/java/src/main/java`
ja_jp: `src/main/java` を、生成されたプロジェクトから `runtime/src/main/codestarts/quarkus/aloha-codestart/java/src/main/java` に移動します

source: Move the affected code in a sub-module and make the dependency non-optional (as is the best practice).
ja_jp: 影響を受けるコードをサブモジュールに移動し、依存関係を非オプションにする（ベストプラクティスとして）。

source: Move the non-application root path (/q)
ja_jp: アプリケーション以外のルートパスを移動 (/q)

source: Move to the root directory of your application.
ja_jp: アプリケーションの root ディレクトリーに移動します。

source: Moving Forward
ja_jp: 将来

source: Moving a lot of work to build time. As RESTEasy Reactive was built from the ground up to serve the needs of Quarkus, it benefits from the tightest possible integration with Quarkus and is probably the extension that does the most build time work. This in turn results in creating an optimal data pipeline for serving each request, helping the JIT compiler by generating bytecode to inline runtime operations, eliminating reflection at runtime (both for invoking methods and for determining types) and reducing memory allocations.
ja_jp: 多くの作業をビルド時に移行しています。RESTEasy Reactive は、Quarkus のニーズに応えるためにゼロから構築されています。そのため、Quarkus との統合が可能な限り緊密に行われており、おそらく最も多くをビルド時に作業を行うエクステンションとなっています。これにより、各リクエストを処理するための最適なデータパイプラインを作成し、実行時の操作をインラインで行うバイトコードを生成することで JIT コンパイラを支援し、実行時の (メソッドの呼び出しと型の決定のための) リフレクションを排除し、メモリーの割り当てを削減します。

source: Moving the `KEY_PAIR_GEN.initialize(1024);` call to the run-time executed method `encryptDecrypt` is enough to solve this particular issue.
ja_jp: `KEY_PAIR_GEN.initialize(1024);` の呼び出しを、実行時に実行されるメソッド `encryptDecrypt` に移すことで、この特定の問題を解決できます。

source: Moving the `KEY_PAIR_GEN.initialize(1024);` call to the run-time executed method `encryptDecrypt` is enough to solve this particular issue. Rebuild the application and verify that encrypt/decrypt endpoint works as expected by sending any message and check if the reply is the same as the incoming message:
ja_jp: この特定の問題を解決するには、 `KEY_PAIR_GEN.initialize(1024);` 呼び出しを実行時に実行されるメソッド encryptDecrypt に移動するだけで十分です。アプリケーションを再構築し、メッセージを送信して暗号化/復号化エンドポイントが期待どおりに機能することを確認し、応答が受信メッセージと同じかどうかを確認します。

source: Moving to Quarkus from a large SpringBoot ecosystem seemed overwhelming at first, but in the end, it was a simple straight-forward transition. Quarkus not only made Java development fun again but also drastically improved the developer experience and Logicdrop's ability to deliver features faster.
ja_jp: 大規模なSpringBootエコシステムからQuarkusへの移行は、最初は圧倒されるようでしたが、最終的には単純明快な移行となりました。QuarkusはJavaの開発を再び楽しくしてくれただけでなく、開発者の体験を劇的に改善し、Logicdropの機能をより早く提供できるようになりました。

source: Moving to the rule unit programming model
ja_jp: ルールユニットプログラミングモデルへの移行

source: Much like a concert, we want each tour stop to be a unique experience for the audience. Each performer is encouraged to demo or talk about what they are passionate about with Quarkus. You *DO NOT* have to be an expert or know everything there is about Quarkus. The event organizer will work with you ahead of time to set the agenda and organize the demo setlist so you have time to prepare (see sample setlist below). It will be fun, we promise.
ja_jp: コンサートのように、それぞれのツアー先でお客様にユニークな体験をしていただきたいと思っています。各パフォーマーは、自分がQuarkusで情熱を傾けていることをデモしたり、話したりすることができます。専門家である必要はあり *ません* し、Quarkusのすべてを知っている必要もありません。イベント主催者は、事前に参加者と協力してアジェンダを設定し、デモのセットリストを作成しますので、準備に時間をかけることができます（下記のサンプルセットリストを参照）。楽しいイベントになることをお約束します。

source: Multi Module Projects
ja_jp: マルチモジュールプロジェクト

source: Multi WASM Module Support
ja_jp: マルチ WASM モジュールサポート

source: Multi build items
ja_jp: マルチビルドアイテム

source: Multi build values are always considered _optional_. If not present, an empty list will be injected.
ja_jp: マルチビルド値は常に _オプション_ とみなされます。存在しない場合は、空のリストが挿入されます。

source: Multi-Service Example: Custom Network and Dependencies
ja_jp: 複数サービスの例: カスタムネットワークと依存関係

source: Multi-Tenancy
ja_jp: マルチテナンシー

source: Multi-Thread
ja_jp: マルチスレッド

source: Multi-module Maven Projects and the Development Mode
ja_jp: マルチモジュールのMavenプロジェクトと開発モード

source: Multi-module Projects
ja_jp: マルチモジュールプロジェクト

source: Multi-module projects and layering
ja_jp: マルチモジュールプロジェクトとレイヤリング

source: Multi-module setup
ja_jp: マルチモジュール設定

source: Multi-release JARs are not perfect. They're harder to maintain, harder to test, and not always well supported by IDEs. But they do solve this problem. And I would argue that, as library and framework authors, it's our responsibility to ensure the cost is paid once at build time, not at every application startup.
ja_jp: マルチリリース JAR も完璧ではありません。メンテナンスが難しく、テストも難しく、IDE で常に十分にサポートされているわけでもありません。しかし、この問題は解決してくれます。そして、ライブラリーやフレームワークの作者として、コストをアプリケーションの起動時ではなく、ビルド時に一度だけ支払うようにするのは私たちの責任であると私は主張します。

source: Multi-tab support
ja_jp: マルチタブサポート

source: Multi-tenancy
ja_jp: マルチテナンシー

source: Multi-threaded programs might require special attention when trying to understand their runtime behaviour. To demonstrate this, add this `MulticastResource` code to your project (example courtesy of link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo6/DatagramTest.java[Andrei Pangin's Java Profiling presentation]):
ja_jp: マルチスレッドプログラムは、ランタイムの動作を理解しようとするときに特別な注意が必要になる場合があります。これを実証するために、この `MulticastResource` コードをプロジェクトに追加します (この例は link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo6/DatagramTest.java[Andrei Pangin's Java Profiling presentation] からご提供いただいています):

source: Multipart Form support
ja_jp: マルチパートフォームのサポート

source: Multipart Support
ja_jp: マルチパートのサポート

source: Multipart mixed / OData usage
ja_jp: マルチパート混合/OData の使用状況

source: Multipart output
ja_jp: マルチパート出力

source: Multipart support
ja_jp: マルチパート対応

source: MultipartForm can be built using the Class `ClientMultipartForm` which supports building the form as needed:
ja_jp: MultipartForm は、必要に応じてフォームの構築をサポートするクラス `ClientMultipartForm` を使用して構築できます：

source: Multiple Backends Simultaneously
ja_jp: 複数のバックエンドの同時使用

source: Multiple Clients
ja_jp: 複数のクライアント

source: Multiple Datasources
ja_jp: 複数のデータソース

source: Multiple Dev Services for named connections
ja_jp: 名前付き接続のための複数の Dev Services

source: Multiple Incomings and `@Merge`
ja_jp: Multiple Incomings と `@Merge`

source: Multiple Main Methods
ja_jp: 複数のmainメソッド

source: Multiple MongoDB Clients
ja_jp: 複数のMongoDBクライアント

source: Multiple OpenAPI Documents
ja_jp: 複数の OpenAPI ドキュメント

source: Multiple OpenAPI documents can be generated. Each document has its own distinct configuration, and can be configured to use a different set of REST resources.
ja_jp: 複数の OpenAPI ドキュメントを生成できます。各ドキュメントは独自の構成を持ち、異なる REST リソースのセットを使用するように設定できます。

source: Multiple OpenAPI documents will automatically show when they are generated by Quarkus as described in <<generating-multiple-openapi-documents>>. By default, Swagger UI renders a dropdown with entries named after their document name. Assuming a default document, an "order" document, and a "user" document are defined, the following entries will be shown:
ja_jp: <<generating-multiple-openapi-documents>> で説明されているように、Quarkus によって生成されると、複数の OpenAPI ドキュメントが自動的に表示されます。デフォルトでは、Swagger UI はドキュメント名にちなんだ名前のエントリーを持つドロップダウンをレンダリングします。デフォルトのドキュメント、「order」ドキュメント、「user」ドキュメントが定義されていると仮定すると、次のエントリーが表示されます。

source: Multiple Outgoings and `@Broadcast`
ja_jp: Multiple Outgoings と `@Broadcast`

source: Multiple Parameters Example
ja_jp: 複数のパラメーターの例

source: Multiple Persistence Units
ja_jp: 複数の永続性ユニット

source: Multiple Profiles
ja_jp: 複数のプロファイル

source: Multiple Profiles may be active at the same time. The configuration `quarkus.profile` accepts a comma-separated list of profile names: `quarkus.profile=common,dev`. Both `common` and `dev` are separate profiles.
ja_jp: 複数のプロファイルを同時にアクティブにすることができます。 `quarkus.profile` 設定では、カンマで区切られたプロファイル名のリストを受け付けます: `quarkus.profile=common,dev` 。 `common` と `dev` はどちらも別のプロファイルです。

source: Multiple Redis Clients
ja_jp: 複数の Redis クライアント

source: Multiple Redis clients are supported (as well as Sentinel connections)
ja_jp: 複数の Redis クライアントのサポート (Sentinel 接続も同様)

source: Multiple `@Consumes` media types
ja_jp: 複数の `@Consumes` メディアタイプ

source: Multiple annotations on a single method
ja_jp: 単一メソッドでの複数アノテーション

source: Multiple conditions are also supported.
ja_jp: 複数の条件にも対応しています。

source: Multiple conditions example
ja_jp: 複数条件の例

source: Multiple datasources
ja_jp: 複数のデータソース

source: Multiple mailer configurations
ja_jp: 複数のmailer設定

source: Multiple mailers
ja_jp: 複数のメーラー

source: Multiple options exist to print information about garbage collection cycles, depending on the level of detail required. The minimum detail is provided `-XX:+PrintGC`, which prints a message for each GC cycle that occurs:
ja_jp: ガベージコレクションサイクルに関する情報を表示するための複数のオプションが必要な詳細度に応じて存在します。最小限の詳細は、 `-XX:+PrintGC` で提供され、発生した各GCサイクルのメッセージを表示します。

source: Multiple options may be separated by a comma. For example, one could use:
ja_jp: 複数のオプションはカンマで区切ることができます。例えば、次のように使用することができます。

source: Multiple or "multi" build items are final classes which extend `io.quarkus.builder.item.MultiBuildItem`. Any number of multi build items of a given class may be produced by any number of steps, but any steps which consume multi build items will only run _after_ every step which can produce them has run.
ja_jp: マルチビルドアイテムは、 `io.quarkus.builder.item.MultiBuildItem` を拡張したfinalクラスです。あるクラスのマルチビルドアイテムは、任意の数のステップで、任意の数生成できますが、マルチビルドアイテムを利用するステップは、それらを生成できるすべてのステップが実行された後のみ実行されます。

source: Multiple persistence units
ja_jp: 複数の永続化ユニット

source: Multiple persistence units support for the Hibernate ORM extension
ja_jp: Hibernate ORMエクステンションのための複数の永続化ユニットのサポート

source: Multiple profiles can be specified for the `scan-profiles` and `scan-exclude-profiles` configuration properties. Multiple profiles can be specified on resource classes and resource methods by using multiple `@Extension` annotations. The `x-smallrye-profile` extensions are *not* included in the final OpenAPI documents.
ja_jp: `scan-profiles` および `scan-exclude-profiles` 設定プロパティーには複数のプロファイルを指定できます。リソースクラスおよびリソースメソッドには、複数の `@Extension` アノテーションを使用して複数のプロファイルを指定できます。`x-smallrye-profile` エクステンションは、最終的な OpenAPI ドキュメントには *含まれません*。

source: Multiple profiles priority work in reverse order. With `quarkus.profile=common,dev`, Quarkus first checks the `dev` profile and then the `common` profile.
ja_jp: 複数のプロファイルの優先順位は逆順で動作します。 `quarkus.profile=common,dev` の場合、Quarkus はまず `dev` プロファイルを、次に `common` プロファイルをチェックします。

source: Multiple tenants that can support Bearer Token or Authorization Code Flow mechanisms
ja_jp: ベアラートークンまたは認可コード・フロー・メカニズムをサポートする複数のテナント
